using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace year
{
    class Program
    {
        static void Main(string[] args)
        {

            int m; // змінна для місяця від якого починаємовідраховувати
            int d = 0; // змінна для дня від якого починаємовідраховувати
            int y;// змінна для року від якого починаємовідраховувати
            int m1;// змінна для місяця до якого рахуємо 
            int d1 = 0;// змінна для дня до якого рахуємо 
            int y1;// змінна для року до якого рахуємо 
            int dab = 0;// кількість днів між цими датами 
            bool l = true;//використовуємо для перевірки чи однаковий рік та місяць 
            bool b = true;//виконуємо 
            try
            {
                do
                {
                    Console.WriteLine("enter year (1)");
                    y = int.Parse(Console.ReadLine());// вводимо рік та переводимо його в int
                } while (y <= 0);// перевірямо щоб він був бульший за 0
                do
                {
                    Console.WriteLine("enter month (1)");
                    m = int.Parse(Console.ReadLine());// вводимо місяць та переводимо його в int
                } while ((m > 12) || (m < 0));// перевіряємо щоб він був менший чи рірний за 12 ала біляший за 0

                // в рісних місяцях різна кількість днів тому використовуємо команду якщо щоб дізнатися якій саме діапазан мі можемо використовувати
                if ((m == 4) || (m == 6) || (m == 9) || (m == 11)) // місяці в яких 30 днів 
                {
                    do
                    {
                        Console.WriteLine("enter day (1)");
                        d = int.Parse(Console.ReadLine());// вводимо день та переводимо його в int
                    } while ((d > 30) || (d <= 0));//перевіряємо щоб він був менший чи рівній 30 та більший за 0
                }
                if ((m == 1) || (m == 3) || (m == 5) || (m == 7) || (m == 8) || (m == 10) || (m == 12))// місяці в яких 31 днів 
                {
                    do
                    {
                        Console.WriteLine("enter day (1)");
                        d = int.Parse(Console.ReadLine());// вводимо день та переводимо його в int
                    } while ((d > 31) || (d <= 0));//перевіряємо щоб він був менший чи рівній 31 та більший за 0
                }
                if (m == 2)//місяць в якому 28 чи 29 днів залежно від року
                {
                    if (y % 4 == 0) // перевіряємо чи введений рік є високосним
                    {
                        do
                        {
                            Console.WriteLine("enter day (1)");
                            d = int.Parse(Console.ReadLine());//вводимо день та переводимо його в int
                        } while ((d > 29) || (d <= 0));//перевіряємо щоб він був менший чи рівній 29 та більший за 0, якщо рік високосний 
                    }
                    else
                    {
                        do
                        {
                            Console.WriteLine("enter day (1)");
                            d = int.Parse(Console.ReadLine());//вводимо день та переводимо його в int
                        } while ((d > 28) || (d <= 0));//перевіряємо щоб він був менший чи рівній 28 та більший за 0, якщо не високосний
                    }
                }

                do
                {
                    Console.WriteLine("enter year (2)");
                    y1 = int.Parse(Console.ReadLine());//вводимо другий рік та переводимо його в int
                } while (y > y1);// перевірямо щоб він був бульший за попередній введений рік

                // якщо роки однакові то перший місць повинен бути менший ніж наступний а якщо ні то ця умова не обовязкова
                if (y != y1) // перевиряємо чи роки рівні 
                {
                    do
                    {
                        Console.WriteLine("enter month (2)");
                        m1 = int.Parse(Console.ReadLine());//вводимо другий місяць та переводимо його в int
                    } while ((m1 > 12) || (m1 < 0));// якщо роки різні то перевіряємо щоб введений місяць був менший за 12 та більший за 0
                }
                else
                {
                    do
                    {
                        Console.WriteLine("enter month (2)");
                        m1 = int.Parse(Console.ReadLine());//вводимо другий місяць та переводимо його в int
                    } while ((m1 > 12) || (m1 < m));// якщо роки онакові то введений рік повинен бути менший за 12 та більшій за перший місяць
                }

                if ((m1 == 4) || (m1 == 6) || (m1 == 9) || (m1 == 11))// місяці в яких 30 днів 
                {
                    do
                    {
                        Console.WriteLine("enter day (2)");
                        d1 = int.Parse(Console.ReadLine());//вводимо другий день та переводимо його в int
                    } while ((d1 > 30) || (d1 <= 0));//перевряємо щом введее число було менше ніж 30 але більше ніж 0
                }
                if ((m1 == 1) || (m1 == 3) || (m1 == 5) || (m1 == 7) || (m1 == 8) || (m1 == 10) || (m1 == 12))// місяці в яких 31 днів 
                {
                    do
                    {
                        Console.WriteLine("enter day (2)");
                        d1 = int.Parse(Console.ReadLine());//вводимо другий день та переводимо його в int
                    } while ((d1 > 31) || (d1 <= 0));//перевряємо щом введее число було менше ніж 31 але більше ніж 0
                }
                if (m1 == 2)//місяць в якому 28 чи 29 днів залежно від року
                {
                    if (y1 % 4 == 0)// перевіряємо чи другий рік є високосним
                    {
                        do
                        {
                            Console.WriteLine("enter day (2)");
                            d1 = int.Parse(Console.ReadLine());//вводимо другий день та переводимо його в int
                        } while ((d1 > 29) || (d1 <= 0));//перевіряємо щоб він був менший чи рівній 29 та більший за 0, якщо рік високосний 
                    }
                    else
                    {
                        do
                        {
                            Console.WriteLine("enter day (2)");
                            d1 = int.Parse(Console.ReadLine());//вводимо другий день та переводимо його в int
                        } while ((d1 > 28) || (d1 <= 0));//перевіряємо щоб він був менший чи рівній 28 та більший за 0, якщо ні
                    }
                }


                if ((m == m1) && (y == y1))// перевіряємо чи місяць і другий місяць та рік та другий рік однакові
                {
                    dab = d1 - d;// підраховуємо кількість днів
                    l = false;// якщо false то роки та місяці однакові
                }
                else
                {
                    // підраховуємо кількість днів в неповних місяцях
                    if (((m == 4) || (m == 6) || (m == 9) || (m == 11)) && (b == true))//місяці які мають 30 днів 
                    {
                        dab = 30 - d + d1;// визначаємо яка кількість днів препадая на неповнй місяць 
                        m++;// збільшуємо перший місяць
                        m1--;// зменшуємо другий
                        b = false;// використовуємо b щоб далі не продовжував підраховувати кількість днів
                    }
                    if (((m == 1) || (m == 3) || (m == 5) || (m == 7) || (m == 8) || (m == 10) || (m == 12)) && (b == true))//місяці які мають 31 днів 
                    {
                        dab = 31 - d + d1;// визначаємо яка кількість днів препадая на неповнй місяць 
                        m++;// збільшуємо кількість першого місяця на одін
                        m1--;// зменшуємо кількість другого місяця
                        b = false;// використовуємо b щоб далі не продовжував підраховувати кількість днів
                    }
                    if ((m == 2) && (b == true))// другий місяць може мати 29 чи 28 днів 
                    {
                        if (y % 4 == 0)// перевіряємо чи є цей рік вісокосним
                        {
                            dab = 29 - d + d1;// визначаємо яка кількість днів препадая на неповнй місяць
                            m++;// збільшуємо кількість першого місяця на одін
                            m1--;// зменшуємо кількість другого місяця
                        }
                        else
                        {
                            dab = 28 - d + d1;// визначаємо яка кількість днів препадая на неповнй місяць
                            m++;// збільшуємо кількість першого місяця на одін
                            m1--;// зменшуємо кількість другого місяця
                        }
                        b = false;// використовуємо b щоб далі не продовжував підраховувати кількість днів
                    }
                }
                //Console.WriteLine(dab);
                while ((y <= y1) && (l == true))// підраховуємо кількість днів між різними місяцями та роками враховуючи високоснй рік
                {
                    if (y != y1) // якщо рік не співпадає
                    {
                        while (m <= 12) // початок циклу для підрахунку днів в місяцях
                        {
                            if ((m == 4) || (m == 6) || (m == 9) || (m == 11))//місяці які мають 30 днів
                            {
                                dab = 30 + dab;// підраховуємо кількість днів в місяці в повному місяці
                                m++;// збільшуємо місяць на один

                            }
                            if ((m == 1) || (m == 3) || (m == 5) || (m == 7) || (m == 8) || (m == 10) || (m == 12))//місяці які мають 31 днів
                            {
                                dab = 31 + dab;// підраховуємо кількість днів в місяці в повному місяці
                                m++;// збільшуємо місяць на один
                            }
                            if (m == 2)//цей місяць має 29 чи 28 днів
                            {
                                if (y % 4 == 0) // перевіряємо чи рік високосний
                                {
                                    dab = 29 + dab;// підраховуємо кількість днів в місяці повністю
                                    m++;// збільшуємо місяць на один
                                }
                                else
                                {
                                    dab = 28 + dab;// підраховуємо кількість днів в місяці повністю
                                    m++;// збільшуємо місяць на один
                                }
                            }

                        }
                        m = 1;
                    }

                    else// якщо роки співпадають 
                    {
                        for (int f = m; f <= m1; f++) // проходимо цикл від першого місящя до другого
                        {
                            if ((f == 4) || (f == 6) || (f == 9) || (f == 11))//місяці які мають 30 днів
                            {
                                dab = 30 + dab;// підраховуємо кількість днів в місяці повністю
                            }
                            if ((f == 1) || (f == 3) || (f == 5) || (f == 7) || (f == 8) || (f == 10) || (f == 12))//місяці які мають 31 днів
                            {
                                dab = 31 + dab;// підраховуємо кількість днів в місяці повністю
                            }
                            if (f == 2)//цей місяць має 29 чи 28 днів
                            {
                                if (y % 4 == 0) // перевіряємо чи рік високосний
                                {
                                    dab = 29 + dab;// підраховуємо кількість днів в місяці повністю
                                }
                                else
                                {
                                    dab = 28 + dab;// підраховуємо кількість днів в місяці повністю
                                }
                            }
                        }

                    }
                    y++;// збільшуємо рік на один
                }
                Console.WriteLine("===========");// для зручності
                Console.WriteLine("{0} days", dab);// виводимо кількість підрахованих днів
            }
            catch (Exception e)
            {
                Console.WriteLine("error :{0}", e);
            }
        }
    }
}
